# 13 Konversi nilai numerik ke dalam kategori pada Data Frame

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    38
1    50
2    10
3    21
4    53
5    52
6     9
7    36
8    44
9    61

Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [3]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])

df

   usia kelompok_usia
0    38        dewasa
1    50        dewasa
2    10          anak
3    21        dewasa
4    53        dewasa
5    52        dewasa
6     9          anak
7    36        dewasa
8    44        dewasa
9    61        dewasa

# 14 Menggabungkan dua Pandas Data Frame

Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

Persiapan Data Frame

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A  B   C   D   E
0   9  6  10  12  17
1  10  9   1   7  16
2   9  2   9  11   8
3  14  8   7  19  16
4  15  5  18  12   6

In [7]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A  B   C   D   E
0   9  6  10  12  17
2   9  2   9  11   8
3  14  8   7  19  16

In [8]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A  B   C   D   E
1  10  9   1   7  16
2   9  2   9  11   8
4  15  5  18  12   6

Menggabungkan Dua Data Frame

In [9]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

   A  B  C   D  E
0  9  2  9  11  8

In [10]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A  B   C   D   E
0   9  6  10  12  17
1   9  2   9  11   8
2  14  8   7  19  16
3  10  9   1   7  16
4  15  5  18  12   6

# 15 Memecah Nilai String dari Suatu Kolom ke Dalam Beberapa Kolom Baru

Import Modules

In [11]:
import pandas as pd

print(pd.__version__)

2.0.3

Persiapan Data Frame

In [12]:
data = {'nama':['Rafi Ahmad', 'Chris John', 'Ade Rai'], 
        'tempat_kelahiran':['Bandung, Jawa Barat', 'Banjarnegara, Jawa Tengah', 'Jakarta, DKI Jakarta']}

df = pd.DataFrame(data)
df

         nama           tempat_kelahiran
0  Rafi Ahmad        Bandung, Jawa Barat
1  Chris John  Banjarnegara, Jawa Tengah
2     Ade Rai       Jakarta, DKI Jakarta

Memecah Nama Depan dan Nama Belakang

In [13]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

         nama           tempat_kelahiran nama_depan nama_belakang
0  Rafi Ahmad        Bandung, Jawa Barat       Rafi         Ahmad
1  Chris John  Banjarnegara, Jawa Tengah      Chris          John
2     Ade Rai       Jakarta, DKI Jakarta        Ade           Rai

Memecah Nama Kota dan Propinsi

In [14]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Rafi Ahmad,"Bandung, Jawa Barat",Rafi,Ahmad,Bandung,Jawa Barat
1,Chris John,"Banjarnegara, Jawa Tengah",Chris,John,Banjarnegara,Jawa Tengah
2,Ade Rai,"Jakarta, DKI Jakarta",Ade,Rai,Jakarta,DKI Jakarta

# 16 Menata Ulang Data Frame dengan Mutiple Indexes Menggunakan unstack()

Import Modules

In [15]:
import pandas as pd

print(pd.__version__)

2.0.3

Persiapan Data Frame

In [16]:
df = pd.read_csv('./titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Data Frame dengan Multiple Indexes dari Hasil Groupping

In [17]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

Menata Ulang Data Frame dengan Mutiple Index

In [18]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130